backend/app/controllers/mars_weather_records_controller.rb

SELECT "mars_weather_records".* FROM "mars_weather_records"
---
    def index
        mars_weather_records = MarsWeatherRecord.all